"""
Описати функцію Fib (N) цілого типу, яка обчислює N-й елемент послідовності
чисел Фібоначчі FK, яка описується наступними формулами:
F1 = 1, F2 = 1, FK = FK-2 + FK-1, K = 3, 4, ....
Використовуючи функцію Fib, знайти п'ять чисел Фібоначчі з даними номерами
N1, N2, ..., N5.
"""
n = int(input("enter n: "))


def fibonachi(n):
    fib = [0]*(n+5)
    fib[0] = 1
    fib[1] = 1
    for i in range(2, n+5, 1):
        fib[i] = fib[i - 1] + fib[i - 2]
        i += 1
    for i in range(n, n+5, 1):
        print(fib[i])


fibonachi(n)
